const calc_placement = require('../Logic/placement');

test('ПсП: при вводе текста должен вернуть error', () => {
    expect(calc_placement(5, 4, 'fg4', 0, 0, 0, 0, 0, 0, 0))
        .toBe("введите числа больше 0");
});

test('ПсП: при вводе не целого числа должен вернуть error', () => {
    expect(calc_placement(4, 5.45, 7, 0, 0, 0, 0, 0, 0, 0))
        .toBe("введите целые числа");
});

test('ПсП: при вводе 2, 4, 7 должен вернуть 25740', () => {
    expect(calc_placement(2, 4, 7, 0, 0, 0, 0, 0, 0, 0))
        .toBe(25740);
});

test('ПсП: при вводе 7, 4, 3, 5, 9 должен вернуть 9647249595984000', () => {
    expect(calc_placement(7, 4, 3, 5, 9, 0, 0, 0, 0, 0))
        .toBe(9647249595984000);
});